[
    {
        "key": "main",
        "isSubSpace": true,
        "name": "Hermes Science's Lab",
        "description": "metaverse space",
        "parentKey": "root",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 0.00,
        "positionY": 2.30,
        "positionZ": 0.00,
        "width": 0,
        "height": 0,
        "depth": 0,
        "maxDistance": 24.00,
        "minDistance": 18.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -1.60,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.50,
        "isLocked": false,
        "documentation": "# Hermes's Science Lab\n\n![Hermes Science Lab](/user-sources/Hermes_Science_Lab_doc-img1.svg)\n\nHermes's Science Lab is a cutting-edge, WebGL-powered digital playground meticulously crafted by **Hermes Concepción**. Designed as a welcoming portal for virtual guests, this interactive website not only invites you to explore its dynamic 3D environments but also serves as a living portfolio showcasing Hermes's professional expertise in several innovative fields.\n\n## Project Demostrations\n\n- **Virtual and Augmented Reality (VR/AR):**  \n  Dive into immersive experiences that blend the digital and physical worlds, demonstrating state-of-the-art techniques in spatial computing.\n\n- **3D Interactive Experiences:**  \n  Engage with stunning, real-time rendered scenes that push the boundaries of interactivity and visual storytelling.\n\n- **Creative Web Development:**  \n  Experience the seamless fusion of art and technology, where cutting-edge code meets imaginative design to create captivating online journeys.\n\n- **User Experience (UX) and Interface Design (UI):**  \n  Discover thoughtfully crafted interactions and interfaces that prioritize intuitive navigation and a delightful user journey.\n\nHermes's Science Lab is more than just a website; it’s an experimental space where advanced technology and creative design converge. Whether you're a tech enthusiast, a design aficionado, or a prospective client looking for innovative digital solutions, this lab provides a firsthand look at the future of interactive web experiences. Step inside and witness the next evolution of digital creativity, where every click reveals a new dimension of professional artistry and technological prowess."

    },
    {
        "key": "studio",
        "isSubSpace": true,
        "name": "Prané Music Studio",
        "description": "musical workspace",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "awards",
        "positionX": 2.25,
        "positionY": 1.50,
        "positionZ": 1.60,
        "width": 1.50,
        "height": 2.20,
        "depth": 2.00,
        "maxDistance": 6.00,
        "minDistance": 5.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Prané Music Studio\n\n![Prané Music Studio](/user-sources/Prane_Music_Studio_doc_img1.svg)\n\nPrané Music Studio is a dedicated audio laboratory within Hermes’s Science Lab, reflecting Hermes Concepción’s deep passion for music composition, sound design, and audio production. From conceptualizing original scores for video games and films to refining final mixes, this immersive environment showcases the artistry and technical skill behind professional music creation.\n\n## Our Focus\n\n- **Composition & Arrangement** \n Explore the process of crafting memorable melodies, harmonies, and orchestral arrangements designed to captivate audiences across various media.\n \n- **Audio Editing & Mixing** \n Discover how raw recordings are refined into polished tracks, balancing clarity and depth to create immersive listening experiences.\n\n- **Film Scoring** \n At Prané Music Studio, film scoring is more than just background music; it’s about crafting an emotional narrative that supports and elevates the visual storytelling. Our process includes thematic development, orchestration and arrangement and adaptive scoring for film synchronization.\n\n- **Interactive Music for Games** \n Gaming is an immersive experience where music plays a crucial role in shaping the player’s journey. Our approach to interactive music for games is centered on creating dynamic soundscapes that respond to gameplay in real time.\n\n## Why Prané?\n\nPrané Music Studio exemplifies Hermes’s innovative approach to blending technology and creativity. Within this virtual space, visitors can feel the workspace where all the magic happens, in collaboration with Caribbean Dream Studios.\n\nHere, every note and sound effect resonates with the spirit of experimentation, pushing the boundaries of audio innovation in the same pioneering way Hermes’s Science Lab expands the horizons of immersive digital experiences."
    },
    {
        "key": "awards",
        "isSubSpace": true,
        "name": "Achievement Zone",
        "description": "trophy's table",
        "parentKey": "main",
        "nearestVerticalSibling": "certificates",
        "nearestHorizontalSibling": "lobby",
        "positionX": 0.25,
        "positionY": 0.70,
        "positionZ": 2.25,
        "width": 0.50,
        "height": 0.60,
        "depth": 1.50,
        "maxDistance": 3.00,
        "minDistance": 3.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# Achievement Zone\n\n![Achievement Zone](/user-sources/Achievements_Table_doc_img1.svg)\n\nThe Achievement Zone is a celebratory gallery within Hermes’s Science Lab, dedicated to highlighting Hermes Concepción’s most notable triumphs in national innovation, culture, and entrepreneurship competitions. Visitors can explore a virtual showcase of trophies that represent each accomplishment, reflecting both the hard work and the visionary spirit behind Hermes’s journey.\n\n## What can you find here?\n\n- **National Recognition** \n Discover how Hermes’s projects and ideas have garnered attention at the national level, showcasing excellence in creative thinking and implementation.\n\n- **Innovation & Entrepreneurship** \n Gain insight into award-winning endeavors that push the boundaries of technology and business, reinforcing a commitment to progress and development.\n\n- **Cultural Impact** \n Explore achievements that celebrate cultural enrichment and diversity, emphasizing the power of creativity and community engagement.\n\nThe Achievement Zone offers a glimpse into the milestones that have shaped Hermes’s professional path, underscoring the dedication, innovation, and passion needed to excel in competitive fields."
    },
    {
        "key": "lobby",
        "isSubSpace": true,
        "name": "Architectural Design Zone",
        "description": "lobby space",
        "parentKey": "main",
        "nearestVerticalSibling": "library",
        "nearestHorizontalSibling": "root",
        "positionX": -1.90,
        "positionY": 0.70,
        "positionZ": 1.20,
        "width": 1.20,
        "height": 1.20,
        "depth": 1.00,
        "maxDistance": 5.00,
        "minDistance": 5.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Architectural Design Zone\n\n![Architectural Design Zone](/user-sources/Architectural_Design_doc_img1.svg)\n\nThe Architectural Design Zone functions as a lobby within Hermes’s Science Lab, showcasing an architectural-scale model (prototype) that spotlights Hermes Concepción’s expertise in crafting immersive digital landscapes. From conceptualizing virtual worlds to integrating them seamlessly into video games and other interactive experiences, this space highlights Hermes’s passion for environmental storytelling and architectural design.\n\n## Our Focus\n\n- **Conceptual Vision & Worldbuilding** \n Explore the creative process behind designing environments that blend narrative, aesthetics, and technical considerations to shape compelling digital worlds.\n\n- **3D Modeling & Architectural Prototyping** \n Discover scaled models and prototypes that demonstrate how real-world architectural principles can be adapted to create believable, functional spaces in virtual media.\n\n- **Technical Implementation & Optimization** \n Delve into performance considerations, from polygon count management to efficient rendering techniques, ensuring smooth and responsive user interactions.\n\nThe Architectural Design Zone offers insight into the creative processes that bring virtual worlds to life. Step in to experience a realm where imagination meets practical ingenuity, reinforcing the spirit of exploration that underpins every corner of Hermes’s Science Lab."
    },
    {
        "key": "library",
        "isSubSpace": true,
        "name": "Software Library",
        "description": "bookshelf",
        "parentKey": "main",
        "nearestVerticalSibling": "stairs",
        "nearestHorizontalSibling": "root",
        "positionX": -1.00,
        "positionY": 0.90,
        "positionZ": -2.00,
        "width": 2.00,
        "height": 1.80,
        "depth": 0.50,
        "maxDistance": 5.00,
        "minDistance": 5.00,
        "maxAzimuthAngle": 0.10,
        "minAzimuthAngle": -0.40,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Software Library\n\n![Software Library](/user-sources/Software_Library_doc_img1.svg)\n\nThe Software Library is a virtual bookshelf where every book tells a story of digital craftsmanship. Here, technical know-how is reimagined as the essential building blocks of creative expression, laying the foundation for interactive experiences, evocative music compositions, artistic CGI, and a vast array of digital arts.\n\n### A Treasury of Tools & Techniques\n\nWithin this curated collection, each volume delves into the software and methodologies that drive innovation. These texts are not mere instruction manuals, they are blueprints for transformation. Whether uncovering advanced coding paradigms, exploring state-of-the-art design frameworks, or detailing dynamic production pipelines, every book reveals the inner workings of Hermes’s creative process.\n\n### Bridging the Gap Between Code and Creativity\n\nAt its core, the Software Library is a celebration of the symbiotic relationship between art and technology. It underscores the idea that technical expertise is itself an art form; a canvas where logic meets imagination. As you peruse these digital tomes, you gain insight into how meticulous planning, innovative tools, and refined processes come together to produce compelling digital narratives."
    },
    {
        "key": "wall",
        "isSubSpace": true,
        "name": "Game Development Frames",
        "description": "wall",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "library",
        "positionX": -0.20,
        "positionY": 1.50,
        "positionZ": -0.80,
        "width": 0.15,
        "height": 2.20,
        "depth": 2.00,
        "maxDistance": 5.00,
        "minDistance": 5.00,
        "maxAzimuthAngle": -1.00,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# Proyect's Wall\n\nIn a quiet alcove of Hermes’s Science Lab, a wall stands adorned with frames; each one a portal into worlds conceived purely for the sake of creation. This is not a gallery of accolades; it’s a sanctuary where projects exist as whispers of possibility, built by and for the dreamers who dare to prototype the world they imagine.\n\nOn the left, two frames invite a closer look. One captures the silhouette of a lifeguard tower, its innovative scissors-like design challenging conventional forms, evoking both functionality and poetry in motion. Beside it, another frame reveals a mobile app that measures the intangible worth of artistic industries—a digital exploration into the value of creativity, untethered by the pursuit of profit.\n\nThese visions were born not from a need to monetize, but from the pure, unfiltered desire to explore and experiment. Here, design transcends the ordinary, and every project is an intimate conversation between the creator and the possibility of what might be. The Prototype Wall is a gentle reminder that sometimes, the most profound innovations arise when we build not for the market, but for our own souls."
    },
    {
        "key": "corner",
        "isSubSpace": true,
        "name": "Background Zone",
        "description": "wall corner",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "wall",
        "positionX": 0.25,
        "positionY": 1.40,
        "positionZ": 0.50,
        "width": 0.80,
        "height": 2.20,
        "depth": 0.50,
        "maxDistance": 4.00,
        "minDistance": 4.00,
        "maxAzimuthAngle": 0.40,
        "minAzimuthAngle": -0.70,
        "maxPolarAngle": 1.80,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# Background Zone\n\n![Background Zone](/user-sources/Background_Corner_doc_img1.svg)\n\nIn this quiet nook, a wall proudly displays the certificates that mark key milestones in a lifelong pursuit of knowledge and creativity. Here, formal achievements in Architecture and Music stand side by side, each symbolizing a deep commitment to understanding space and sound.\n\nA Master’s degree in Videogames crowns the collection; a unique fusion of the two disciplines that not only bridges traditional artistry and design but also transforms them into immersive, interactive digital experiences. This corner isn’t merely a record of academic accomplishments; it’s a window into the journey that empowers every innovative project conceived by Hermes."
    },
    {
        "key": "stairs",
        "isSubSpace": false,
        "name": "Handmade Portfolio",
        "description": "framed panel",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -2.50,
        "positionY": 2.30,
        "positionZ": -2.70,
        "width": 0.90,
        "height": 1.20,
        "depth": 0.30,
        "maxDistance": 3.00,
        "minDistance": 3.00,
        "maxAzimuthAngle": 0.10,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Conceptual Drawing: 'It's not that hard to catch humans'\n\nIn this evocative handmade surreal drawing, Hermes distills a profound social commentary into a single, arresting image. At first glance, a serene floating island cradles a treasure concealed beneath a solitary tree—a beacon of allure and promise. Yet, as one’s gaze travels beyond this inviting tableau, the island is revealed to be circumscribed by a vast, imposing cage. Circling this prison are sharks, their presence both graceful and menacing, as they patrol the periphery with an ever-watchful vigilance.\n\nThe long, winding path that leads to the treasure serves as a metaphor for human ambition and the pursuit of wealth. However, the very guardians of this coveted bounty (the sharks) hint at a darker truth. The treasure, rather than being a reward, is cast in the role of bait, meticulously placed to ensnare the unsuspecting traveler. In this paradox, Hermes exposes the vulnerability of human desire: even when the trap is laid bare, the seductive pull of riches remains irresistibly potent.\n\nBy interweaving elements of nature and contrived design, the drawing challenges the viewer to confront the paradox of temptation. It is a visual allegory that critiques how the promise of material gain can often mask a deliberate ploy; a reminder that what glitters may well be a well-orchestrated snare, poised to capture those who dare to dream too freely."
    },
    {
        "key": "rooftop",
        "isSubSpace": true,
        "name": "UX/Tech-Art Studio",
        "description": "conceptual rooftop",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "stairs",
        "positionX": 1.50,
        "positionY": 3.50,
        "positionZ": -1.00,
        "width": 2.00,
        "height": 2.00,
        "depth": 2.00,
        "maxDistance": 6.00,
        "minDistance": 6.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# UX/Tech-Art Studio\n\n![UX/Tech-Art Studio](/user-sources/UX_Tech-Art_doc_img1.svg)\n\nPerched on the rooftop of Hermes’s Science Lab, the UX/Tech-Art Studio is an enclave where disciplined creativity takes flight. Dominating the space is an immense, otherworldly tree; a symbolic beacon that defies conventional architectural logic. Its sprawling, surreal branches represent the uncharted pathways of thought, providing a visual metaphor for deep concentration and the organic growth of innovative ideas.\n\nBeneath this striking arboreal figure lies a digital easel paired with a solitary chair: a minimalist yet potent setup for contemplation. Here, the tools of the trade are both literal and metaphorical. The easel stands as a platform for conceptual sketches, algorithms, and design frameworks, while the chair invites one to pause, reflect, and dissect the intricate problems of computer graphics and interactive experiences. This is where mathematical precision converges with artistic expression, forming a sanctuary for UX refinement and tech-art exploration.\n\nIn this elevated retreat, the seemingly paradoxical elements (a fantastical tree, a digital canvas, and the quiet intensity of focused thought) come together to illustrate a personal paradise for innovation. It is a realm where the complexities of digital interactivity are unraveled and reimagined, one deliberate stroke of insight at a time."
    },
    {
        "key": "musicportfolio",
        "isSubSpace": false,
        "name": "Music Portfolio",
        "description": "TV screen",
        "parentKey": "studio",
        "nearestVerticalSibling": "aboutprane",
        "nearestHorizontalSibling": "root",
        "positionX": 2.60,
        "positionY": 1.50,
        "positionZ": 1.60,
        "width": 0.10,
        "height": 0.70,
        "depth": 1.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": -1.57,
        "minAzimuthAngle": -1.57,
        "maxPolarAngle": 1.90,
        "minPolarAngle": 1.90,
        "isLocked": false,
        "documentation": "# Case: “Que tu estés aquí” (composition, arrangement and interpretation)\n\n![Prané - Que tu estés aquí](https://www.youtube.com/watch?v=Fy1bch_8JlU)\n\n### Song Composition\n\n**Melodic and Harmonic Structure:**\n\nThe composition focuses on an emotional melody based on the musical theme \"Corales Del Sur\" created by Mando. Although the song was not originally intended for a duet, the recorded version was made together with Maite Reyes, who was a member of the band \"Prané\" founded by Hermes in 2014. Underpinning this is a contemporary harmonic progression that subtly shifts to mirror the lyrical nuances, providing a warm yet introspective backdrop. This approach is common in tracks where the lyrical content (here suggested by the title’s emphasis on presence and connection) drives the emotional core of the song.\n\n**Lyric-Driven Narrative:**\n\nThe lyrics, implied by the title “Que tu estés aquí” (“You To Be Here”), play a central role in the composition. The song begins with the narration of multiple idealistic and utopian wishes or dreams, which when reaching the chorus, take a nostalgic turn saying \"but... I want you to be here\", implying that all these utopian wishes are not enough without the company of the loved one.\n\n### Arrangement and Production\n\n**Layering and Instrumentation:**\n\nThe arrangement transforms the core composition into a dynamic sonic landscape. It likely begins with a minimalist introduction—perhaps featuring a solo instrument or ambient textures—to set a contemplative mood. As the song progresses, additional layers are introduced: rhythmic elements, gentle percussion, and complementary instruments such as acoustic or electric guitars, keyboards, or subtle synth pads. This layering builds tension and then releases it in the chorus, underscoring the emotional peaks of the song.\n\n**Dynamic Contrast and Textural Shifts:**\n\nA hallmark of effective arrangement is the use of dynamics to guide the listener’s emotional journey. In “Que tu estés aquí,” quieter, more intimate sections allow the vocals and lyrics to take center stage, drawing the listener in. These are contrasted with fuller, richer passages where the full band or a more complex production arrangement takes over, amplifying the emotional intensity. This contrast not only provides variety but also mirrors the thematic elements of presence versus absence or intimacy versus expansiveness.\n\n**Fusion of Organic and Electronic Elements:**\n\nWhile the foundation might be built on organic instrumentation—like traditional guitar lines or piano chords—the arrangement may also incorporate subtle electronic textures. These ambient layers add depth and modernity to the track, helping it resonate with a contemporary audience while still maintaining a timeless quality. Such a blend is typical of many modern alternative tracks, where the warmth of acoustic sounds meets the precision and atmosphere of electronic production."
    },
    {
        "key": "aboutprane",
        "isSubSpace": false,
        "name": "Prané Music Branding",
        "description": "logotype panel",
        "parentKey": "studio",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 2.70,
        "positionY": 2.30,
        "positionZ": 1.60,
        "width": 0.30,
        "height": 0.80,
        "depth": 1.80,
        "maxDistance": 3.00,
        "minDistance": 3.00,
        "maxAzimuthAngle": -0.80,
        "minAzimuthAngle": -1.85,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Prané Music Branding\n\nPrané is the branding that Hermes uses to make a separation between the person (technical artist) from the personality (poetic performer), because this personality is also considered a crafted artistic product.\n\nThe word “Prané” carries a gentle cadence, like a whispered supplication set to the resonant breath of a Ney flute. It merges the idea of prayer with the airy, soulful timbre of the Oriental Ney, channeling a profound sense of reverence for music’s deeper philosophies. Much like a liturgy rising above the hush of dusk, the name hints at a spiritual undercurrent, a plea and a melody intertwined.\n\nIn the logotype, that sense of musical prayer echoes through the graceful union of letters. The triangle stands tall at the center, a silent spire reminiscent of an ancient temple’s archway, framing the band’s feline muse. The cat itself, perched in calm confidence, is both mysterious and unflinchingly cool, wearing an air of knowing aloofness, like a guardian spirit presiding over the creative realm. The minimal lines and shapes mirror the uncluttered purity of a single flute note in an empty cathedral, letting each element breathe.\n\nTogether, name and symbol become a mantra for the band’s philosophy: every note, every lyric becomes a quietly passionate offering “Prané” where music, like a prayer, ascends into something transcendental."
    },
    {
        "key": "nodes",
        "isSubSpace": false,
        "name": "Interactive Music for Games",
        "description": "left sided monitor screen",
        "parentKey": "studio",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 2.38,
        "positionY": 1.03,
        "positionZ": 1.33,
        "width": 0.08,
        "height": 0.30,
        "depth": 0.50,
        "maxDistance": 1.00,
        "minDistance": 1.00,
        "maxAzimuthAngle": -1.85,
        "minAzimuthAngle": -1.85,
        "maxPolarAngle": 1.90,
        "minPolarAngle": 1.90,
        "isLocked": false,
        "documentation": "# Thesis: Interactive-Parametric Music\n\nThis thesis introduces Música Interactiva-Paramétrica (MIP) as a response to the economic and creative challenges posed by modern digital music consumption. The research argues that traditional music distribution models—particularly streaming services—have devalued the financial sustainability of musicians. The solution proposed is an interactive, algorithm-driven approach that allows users to experience and modify musical compositions dynamically, much like interactive narratives in video games or digital media.\n\n## **Innovations in Interactive-Parametric Music**\n\nThe project presents a protocol for interactive music composition that integrates real-time parametric adjustments based on user input. The key innovations include:\n\n- **MIP Protocol:** This is the core innovation of the thesis by Hermes Concepción. It establishes a structured system for creating, organizing, and consuming music in an interactive, real-time adaptable format. Unlike traditional music composition, where pieces follow a fixed, linear progression, MIP allows for dynamic modification based on user interaction, much like adaptive video game music or interactive media narratives.\n- **Real-Time Musical Adaptation:** Unlike conventional compositions, MIP enables user-driven transformations, where parameters like tempo, harmony, and instrumentation can change in response to external inputs.\n- **Application of Parametric Design to Music:** Inspired by parametric architecture and design, MIP incorporates computational rules to generate flexible, adaptable musical structures.\n- **Integration with Video Games:** A prototype was developed using the video game Inside, demonstrating how music can evolve based on gameplay decisions.\n\n## **MIP vs. Traditional Music Systems**\n\n| Feature | Traditional Music | MIP Protocol |\n| --- | --- | --- |\n| **Structure** | Linear, pre-recorded | Non-linear, modular, adaptable |\n| **Interactivity** | Passive listening | Real-time changes based on input |\n| **Playback Flexibility** | Fixed from start to end | User-driven flow and modifications |\n| **Adaptation** | Requires separate versions | Single framework can generate variations dynamically |\n| **Examples** | Albums, movie soundtracks | Video game music, AI-generated compositions, interactive installations |\n\nThe MIP Protocol is a revolutionary step toward a future where music is not just listened to, but experienced dynamically. By integrating parametric design principles with interactive audio techniques, it offers a new model for music creation, distribution, and consumption."
    },
    {
        "key": "filmscore",
        "isSubSpace": false,
        "name": "Music for Films",
        "description": "right sided monitor screen",
        "parentKey": "studio",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "webgl",
        "positionX": 2.38,
        "positionY": 1.03,
        "positionZ": 1.87,
        "width": 0.08,
        "height": 0.30,
        "depth": 0.50,
        "maxDistance": 1.00,
        "minDistance": 1.00,
        "maxAzimuthAngle": -1.15,
        "minAzimuthAngle": -1.15,
        "maxPolarAngle": 1.90,
        "minPolarAngle": 1.90,
        "isLocked": false,
        "documentation": "# Case: “Almost a Happy World” (film scoring)\n\n![Almost a Happy World](https://www.youtube.com/watch?v=D4NoyatJI2c)\n\n\"Almost a Happy World\" (original title: \"Un Mundo Casi Feliz\") is a 3‑minute Dominican short film that uses humor and irony to examine the paradox of our hyper‐connected digital age. Directed and written by Danny Camacho—a filmmaker from Santo Domingo known for his energetic storytelling—the film follows roommates Jefri and Ariel, who are immersed in a lifestyle saturated with consumerism and constant online connectivity. Ironically, despite being always “plugged in,” their interactions reveal a growing emotional disconnect and a sense of isolation, highlighting how an overreliance on digital networks can undermine genuine human relationships.\n\nThe film’s sonic palette plays an essential role in reinforcing its satirical take on modern connectivity. Though \"Almost a Happy World\" runs only three minutes, its film score and sound design are carefully crafted to both complement and underscore the narrative’s ironic edge.\n\n### Film Scoring\n\nThe musical score—credited to Hermes Prané—features a mix of electronic and organic elements that mirror the dual nature of our digital age. On one hand, the score employs upbeat, rhythmic patterns and synthesized textures that evoke the constant hum of online notifications and digital chatter. These elements create a sense of urgency and overstimulation, echoing the frenetic pace of modern consumer culture. On the other hand, more subdued and contemplative motifs emerge at key narrative moments, reflecting the underlying loneliness and disconnect of the characters. This dynamic interplay between energetic digital sounds and softer, more reflective passages not only punctuates the film’s humor but also deepens its commentary on the paradox of being simultaneously connected and isolated.\n\n### Sound Effects and Design\n\nEqually important is the film’s sound design, which was also overseen by Hermes Prané. The sound effects are used with precision: everyday noises—the subtle clicks of digital devices, the murmur of ambient chatter, even the mechanical hum of urban life—are amplified and interwoven into the score. These layers of diegetic sounds (those that belong to the world of the film) contrast with the non-diegetic musical cues, drawing attention to the irony that while the characters are constantly \"online\", there is a palpable absence of authentic human warmth. In several scenes, the sound design deliberately isolates the viewer, using abrupt silences or minimalistic effects to signal moments of emotional emptiness. This approach reinforces the idea that despite the constant barrage of digital information, genuine, meaningful connection remains elusive.\n\n### Overall Impact\n\nTogether, the score and sound effects contribute to the film’s overall atmosphere—one that is at once playful and reflective. The energetic, digitally influenced music underscores the superficial allure of modern connectivity, while the careful layering of everyday sound effects reminds us of the isolation lurking behind our screens. In just three minutes, \"Almost a Happy World\" uses its sonic elements not only to entertain but also to provoke thought about the cost of our hyper-connected lifestyles. This meticulous attention to sound design makes the short film a compelling study in how audio can serve as both narrative punctuation and thematic reinforcement."
    },
    {
        "key": "webgl",
        "isSubSpace": false,
        "name": "WebGL Coding",
        "description": "laptop screen",
        "parentKey": "studio",
        "nearestVerticalSibling": "musicportfolio",
        "nearestHorizontalSibling": "nodes",
        "positionX": 2.07,
        "positionY": 0.86,
        "positionZ": 1.59,
        "width": 0.08,
        "height": 0.30,
        "depth": 0.36,
        "maxDistance": 1.00,
        "minDistance": 1.00,
        "maxAzimuthAngle": -0.70,
        "minAzimuthAngle": -1.85,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# WebGL Coding\n\nWebGL (Web Graphics Library) is a JavaScript API that enables rendering interactive 2D and 3D graphics within any compatible web browser without the need for additional plugins. Built on top of OpenGL ES (a subset of the OpenGL standard tailored for embedded systems), WebGL leverages the power of the graphics processing unit (GPU) to produce high-performance visual content directly in the browser. This capability has transformed how we experience the web, opening up innovative possibilities in design, gaming, data visualization, and more.\n\n## Redefining Digital Representation\n\n**3D Immersive Environments**\n\nHermes’s projects are more than just web pages—they are immersive 3D environments that transform how users perceive and interact with digital content. By using WebGL, he reimagines traditional UX design, moving away from flat interfaces to spatial, interactive experiences that provide depth, perspective, and context. Every product he creates is a re-conceptualization of digital entities, presenting them in three-dimensional space with a fresh, innovative twist.\n\n**Merging Art and Technology**\n\nAs a technical artist, Hermes bridges the gap between the precision of code and the creativity of visual art. WebGL is his digital brush, allowing him to paint with light and motion. This melding of technology and artistry results in products where every element—whether it’s a dynamic particle effect, an intricate texture, or a subtle shading gradient—is crafted to enhance the overall user experience. His work turns the web into a living canvas where design isn’t just seen—it’s experienced.\n\n**Sonic and Visual Harmony**\n\nWith his background as a professional musician, Hermes is uniquely positioned to integrate auditory elements with visual designs. WebGL’s capabilities extend beyond just visuals; they can be synchronized with sound to create multisensory experiences. Imagine a digital space where every movement or interaction is accompanied by a harmonious soundscape, making the experience as engaging aurally as it is visually. This synthesis of music and motion helps create environments that resonate on multiple levels, deeply engaging the user’s senses.\n\n**Pioneering Interactive Storytelling and Data Visualization**\n\nHermes’s work redefines storytelling by allowing users to “step into” the narrative. Through WebGL, digital narratives become interactive journeys where every element—from the environment to the characters—responds to user input in real time. Similarly, complex data can be transformed into 3D visualizations that are not only informative but also aesthetically compelling, providing insights that are both intuitive and engaging."
    },
    {
        "key": "mipymes",
        "isSubSpace": false,
        "name": "Business Creation Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 1.68,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Business Creation Award\n\nIn 2017, Hermes distinguished himself as a visionary in cultural entrepreneurship by becoming a finalist at the “Innovation and Business Creation 5.0” event organized by Unphu Emprende. His project, Prané, creatively fused musical expression with cultural narratives, embodying a fresh and innovative approach to the arts. This recognition highlighted several key aspects of Hermes’s work:\n\n- **Innovative Integration:** Prané uniquely combined cultural traditions with modern musical expression, demonstrating how art can drive business innovation.\n- **Entrepreneurial Vision:** Hermes showcased a deep understanding of how to turn creative ideas into viable ventures, proving that cultural projects can also be sustainable business models.\n- **Leadership and Impact:** His ability to lead a project that not only resonated with cultural communities but also attracted the attention of industry experts emphasized his role as a forward-thinking leader in the creative economy.\n\nThis accolade not only affirmed Hermes’s talent and entrepreneurial spirit but also served as a significant milestone in his journey to merge creativity with business, paving the way for future innovative endeavors."
    },
    {
        "key": "musiccontest",
        "isSubSpace": false,
        "name": "Music Composition Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "mipymes",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 1.94,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Music Composition Award\n\nIn the Music Composition Contest organized by M-Gallery Hotels, Hermes secured first place with his outstanding song \"Se oye, se ve y se siente.\" His innovative blend of compelling lyrics and memorable melody captivated both the audience and the judges, setting his work apart from the competition. As a reward for his creativity and skill, he received a professional recording of the song, which not only elevated the track’s production quality but also broadened its reach.\n\nThis achievement underscores Hermes's talent for crafting musical narratives that resonate deeply, proving his capability to merge artistic expression with professional excellence."
    },
    {
        "key": "bcrd",
        "isSubSpace": false,
        "name": "Payment Methods Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "musiccontest",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 2.21,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Payment Methods Award\n\nIn early 2018, Hermes received a notable distinction from the Central Bank of the Dominican Republic (BCRD) through its Payment Methods Innovation Award. As highlighted in the newspaper clipping, this award recognized his creative and forward-thinking approach to electronic payment solutions. By designing a concept that streamlined and modernized payment processes, he demonstrated both technical ingenuity and an understanding of consumer needs.\n\n**Key points of this recognition include:**\n\n- **Innovation in Financial Technology (FinTech):** Hermes’s project introduced novel methods for digital transactions, showcasing a commitment to improving the accessibility and efficiency of electronic payments for the artistic industry.\n- **Research and Practical Application:** His thorough research and clear implementation strategy underlined how new technologies could be integrated into existing systems, making the concept both innovative and feasible.\n- **Impact on the Local Financial Ecosystem:** By focusing on solutions that addressed real-world challenges within the Dominican Republic’s financial landscape, Hermes’s proposal aligned with the Central Bank’s goal of fostering digital transformation and financial inclusion for cultural sector.\n\nThis accolade not only honored Hermes’s technical and creative prowess but also highlighted the growing importance of digital payments in driving economic growth and enhancing user experience."
    },
    {
        "key": "arqtur",
        "isSubSpace": false,
        "name": "Architectural Design Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "bcrd",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 2.48,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Scissors Lifeguard Booth\n\nAt ARQTUR 2015 in Puerto Plata, Dominican Republic, Hermes’s architectural vision took center stage with a groundbreaking lifeguard tower design inspired by the form of scissors. This bold concept won him an architectural design award for its ability to challenge traditional approaches and blend functionality with artistic flair. By reimagining a lifeguard tower—often seen purely as a utilitarian structure—into a dynamic, sculptural form, Hermes demonstrated how architecture can simultaneously address practical needs and inspire poetic reflection.\n\n**Key highlights of the project include:**\n\n- **Innovative Form:** The “scissors-like” silhouette offered a striking departure from conventional lifeguard tower designs, underscoring the power of imagination in architecture.\n- **Practical Functionality:** Despite its unconventional shape, the structure retained a high level of functionality, providing lifeguards with clear sightlines and efficient use of space.\n- **Poetic Impact:** Beyond meeting safety requirements, the design embodied a sense of movement and artistic expression, showcasing how public structures can enrich the aesthetic and cultural environment of a beachfront community.\n\nThis award underlined Hermes’s ability to transform a routine architectural typology into a visionary project that merges practicality with a distinctly creative spirit."
    },
    {
        "key": "literary",
        "isSubSpace": false,
        "name": "Storytelling Script Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "arqtur",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 2.74,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Literary Contest for Cinematography Scripting\n\nIn 2013, Hermes’s storytelling prowess was recognized at the seventh literary contest for students at UNIBE, where he won an award in the “cinematography scripting” category. This accolade celebrated his remarkable ability to craft a compelling narrative, demonstrating both a keen sense for visual storytelling and a sophisticated grasp of cinematic structure.\n\n**Key elements of this recognition include:**\n\n- **Creative Narrative:** Hermes’s script stood out for its originality and imaginative approach, blending engaging dialogue with evocative scene descriptions.\n- **Cinematic Vision:** The award underscored his talent for envisioning a storyline that could seamlessly translate from page to screen, highlighting a natural flair for filmic pacing and visual elements.\n- **Storytelling Mastery:** By capturing complex emotions and character development within a concise script format, Hermes demonstrated a strong command of narrative techniques that resonate with audiences.\n\nThis achievement not only marked a significant milestone in Hermes’s early creative journey but also showcased his ability to weave captivating tales suited for the world of cinema."
    },
    {
        "key": "gamedev",
        "isSubSpace": false,
        "name": "Environment Art for Games",
        "description": "board",
        "parentKey": "wall",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -0.20,
        "positionY": 1.98,
        "positionZ": -1.35,
        "width": 0.10,
        "height": 0.90,
        "depth": 0.65,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# Environment Art Development\n\nHermes Concepción significantly contributed to the Synchroverse ecosystem through the creation of multiple, intricately designed game environments. These environments served not only as dynamic gameplay backdrops but also as demonstrative showcases for the innovative Synchroverse tools. By integrating immersive aesthetics with robust AI functionalities, Hermes's designs effectively highlighted the potential of Synchroverse’s development suite. His work provided game developers with ready-to-use packs and toolkits, streamlining the integration of advanced in-game assets and AI-driven interactions. The environments stand as a testament to the synergy between creative design and technological innovation, underscoring their role as both inspirational exhibits and practical resources for next-generation game development.\n\n### Case: **Riftkeepers Starting Hub**\n\nThis captivating hub is a magical medieval Japanese enclave, where ancient traditions blend seamlessly with fantastical elements. At its heart lies a natural lake of holy water, a luminous reservoir overloaded with vital energy. The water shimmers with an ethereal glow, serving as a potent source of life and magic that imbues the entire environment. Around the lake, traditional Japanese architecture—such as elegant pagodas, serene stone bridges, and gracefully curved wooden structures—rests amidst meticulously landscaped gardens packed with sakura trees and mist-shrouded groves.\n\n### Case: **NeoTokio Bar Environment**\n\nIn the NeoTokyo Bar case, an electrifying cyberpunk atmosphere unfolds within a reimagined version of Tokyo. This environment is characterized by neon-lit streets, holographic displays, and rain-soaked alleyways that evoke a sense of urban futurism. Populated by an advanced race of mutant humanoids, the scene seamlessly blends traditional cyberpunk elements with the unexpected twist of genetic evolution. These beings, with their enhanced capabilities and unique visual traits, populate the bar and its surroundings, adding depth to the narrative and an element of intrigue to every interaction.\n\n### Case: Streamer House for AI Agent\n\nAria is a cutting-edge virtual AI agent designed to revolutionize online engagement within the cryptocurrency sphere. Residing in a vibrant streamer house, Aria interacts with her audience through real-time streaming platforms, seamlessly integrating into live broadcasts. Her capabilities extend beyond mere entertainment; she actively discusses crypto-currencies, offering insights, market updates, and analysis to her viewers."
    },
    {
        "key": "guidev",
        "isSubSpace": false,
        "name": "GUI Development for Games",
        "description": "board",
        "parentKey": "wall",
        "nearestVerticalSibling": "gamedev",
        "nearestHorizontalSibling": "root",
        "positionX": -0.20,
        "positionY": 0.91,
        "positionZ": -1.35,
        "width": 0.10,
        "height": 0.90,
        "depth": 0.65,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.10,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# GUI Design and Development\n\nHermes Concepción was instrumental in developing a series of innovative GUIs specifically tailored to demonstrate how Synchroverse technologies can seamlessly integrate with common video game systems. His work focused on creating interfaces that not only exhibited the capabilities of Synchroverse’s advanced AI and immersive environments, but also illustrated practical applications such as inventory management, combat systems, and dynamic NPC interactions. By blending cutting-edge AI functionalities with familiar game mechanics, these GUIs provided clear, intuitive pathways for developers to understand and implement how Synchroverse can elevate traditional gaming experiences. The result is a demonstrative suite that bridges the gap between sophisticated backend technologies and everyday gameplay, showcasing the future potential of integrated, AI-enhanced game design."
    },
    {
        "key": "videogamesdegree",
        "isSubSpace": false,
        "name": "M.A. in Videogames",
        "description": "certificate",
        "parentKey": "corner",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 0.32,
        "positionY": 2.06,
        "positionZ": 0.30,
        "width": 0.42,
        "height": 0.32,
        "depth": 0.10,
        "maxDistance": 1.20,
        "minDistance": 1.20,
        "maxAzimuthAngle": 0.40,
        "minAzimuthAngle": -0.40,
        "maxPolarAngle": 1.60,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# Computer Games and Programming Skills\n\nUpon completing the Master in Videogames program from 2022 to 2023, Hermes acquired a diverse set of skills that spanned both creative and technical aspects of game development. Here's what his journey looked like:\n\n### Course Highlights\n\n- **Game Design Fundamentals:**\n    \n    Hermes learned about the mechanics of gameplay, level design, and genre-specific considerations. He studied both historical successes and current industry trends to develop an intuitive sense of what makes a game engaging.\n    \n- **Art & Animation:**\n    \n    Through intensive modules in 2D/3D animation and digital art, Hermes honed his abilities in character rigging, 3D modeling, and motion graphics. He mastered software tools that allowed him to create visually stunning assets and dynamic animations.\n    \n- **Programming & Engine Mastery:**\n    \n    A significant part of the course was dedicated to understanding and utilizing game engines like Unity. Hermes gained proficiency in programming paradigms essential for interactive applications, enabling him to build robust, feature-rich games from scratch.\n    \n- **Narrative & Storytelling:**\n    \n    Recognizing that a compelling story is at the heart of every great game, Hermes delved into the art of narrative design. He learned how to craft immersive scripts and develop characters whose stories resonate with players.\n    \n- **Problem-Based Learning & Real-World Projects:**\n    \n    The program emphasized hands-on projects and real-world case studies. Hermes participated in team-based challenges that mimicked industry scenarios, allowing him to apply his newly acquired skills in a practical context. These projects not only bolstered his technical expertise but also strengthened his teamwork and leadership abilities.\n\n### Expert in Programming Languages for Games\n\nHermes wanted to deepen his technical expertise even further after his Master in Videogames. To that end, he enrolled in the \"Expert of Programming Languages for Videogames\" course extension—a 24‐week, 450-hour postgraduate diploma offered entirely online by TECH Global University.\n\nIn this course, Hermes revisited the basics of programming languages with an emphasis on object-oriented programming in languages like C++ and C#. The course reinforced core concepts such as data types, control structures, and algorithm design, ensuring that he had a rock-solid programming foundation."
    },
    {
        "key": "architecturedegree",
        "isSubSpace": false,
        "name": "B.A. in Architecture",
        "description": "certificate",
        "parentKey": "corner",
        "nearestVerticalSibling": "videogamesdegree",
        "nearestHorizontalSibling": "root",
        "positionX": 0.32,
        "positionY": 1.63,
        "positionZ": 0.30,
        "width": 0.42,
        "height": 0.50,
        "depth": 0.10,
        "maxDistance": 1.20,
        "minDistance": 1.20,
        "maxAzimuthAngle": 0.40,
        "minAzimuthAngle": -0.40,
        "maxPolarAngle": 1.60,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# B.A. in Architecture\n\nHermes’s journey through UNIBE’s Architecture program started in 2012 and was a transformative blend of creative exploration, technical rigor, and social responsibility. He chose UNIBE because its curriculum, designed to foster holistic and sustainable architectural practices, resonated with his passion for shaping spaces that are both innovative and deeply connected to their community.\n\n### Foundations of Creativity and Technical Excellence\n\nIn his first year, Hermes immersed himself in courses such as the Introductory Seminar on Architecture, Design Studio I, and Digital Architectural Drawing I. These classes introduced him to the basics of architectural design, freehand illustration, and the use of digital tools to communicate ideas effectively. He also gained a solid grounding in communication and historical processes, which helped him appreciate how architectural design evolves over time.\n\n### Building a Robust Skill Set\n\nAs he progressed, Hermes tackled more advanced topics in design, theory, and technical courses during his second and third years. He engaged in design studios that challenged him to integrate sustainable design practices, explore materiality and structural fundamentals, and develop interdisciplinary projects that connected environmental, cultural, and urban planning aspects. Practical workshops and internships provided him with hands-on experience, allowing him to apply classroom learning to real-world architectural challenges.\n\n### Culmination and Professional Readiness\n\nIn the final years, Hermes worked on his graduation project—an ambitious design that combined cutting-edge digital fabrication techniques, sustainable construction methods, and community-oriented urban planning. Guided by UNIBE’s ethos of holistic education, he not only refined his technical skills but also developed a critical and creative mindset essential for today’s architectural landscape. His journey at UNIBE transformed him into a well-rounded architect, equipped to lead projects that balance aesthetic innovation with functional, sustainable design.\n\nThrough perseverance, collaboration, and a commitment to excellence, Hermes emerged as a visionary professional ready to make a lasting impact on the built environment."
    },
    {
        "key": "musicdegree",
        "isSubSpace": false,
        "name": "B.A. in Contemporary Music",
        "description": "certificate",
        "parentKey": "corner",
        "nearestVerticalSibling": "architecturedegree",
        "nearestHorizontalSibling": "root",
        "positionX": 0.32,
        "positionY": 1.19,
        "positionZ": 0.30,
        "width": 0.42,
        "height": 0.32,
        "depth": 0.10,
        "maxDistance": 1.00,
        "minDistance": 1.00,
        "maxAzimuthAngle": 0.40,
        "minAzimuthAngle": -0.40,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# B.A. in Contemporary Music\n\nFrom 2016 to 2020, Hermes embarked on a transformative journey pursuing the Licenciatura en Música Contemporánea at UNPHU (Universidad Nacional Pedro Henríquez Ureña) in the Dominican Republic—a pioneering program in a private institution that has redefined music education in the country.\n\n### Immersive Curriculum and Multidisciplinary Focus\n\nEnrolled in 2016, Hermes was drawn to a curriculum uniquely designed to cover all facets of contemporary music. The program emphasizes four key areas:\n\n- **Composition, Arrangement, and Production:** Students learn to craft original works, arrange pieces for diverse ensembles, and master production techniques in both studio and live settings.\n- **Performance:** Whether as instrumentalists or vocalists, the course hones performance skills through rigorous practice sessions, recitals, and masterclasses led by renowned musicians.\n- **Administration of the Music Business:** Recognizing that the music industry extends beyond creativity, the curriculum includes training in the management and business aspects of music.\n- **Recording Art (Ingeniería de Sonido):** Students gain hands-on experience in sound engineering and studio practices, ensuring they understand both the creative and technical sides of recording.\n\nThese comprehensive subjects provided Hermes with a balanced education—blending classical theory with modern trends, and practical application with critical analysis.\n\nThroughout his studies, Hermes was immersed in a bilingual and technologically advanced environment. The school offered state-of-the-art facilities, including recording studios and performance spaces, where he could put theory into practice through live concerts, workshops, and collaborative projects. Special opportunities such as exchange programs and masterclasses with internationally acclaimed artists enriched his educational experience—exposing him to a global perspective on contemporary music."
    },
    {
        "key": "guitar",
        "isSubSpace": false,
        "name": "Music Production",
        "description": "guitar",
        "parentKey": "corner",
        "nearestVerticalSibling": "musicdegree",
        "nearestHorizontalSibling": "root",
        "positionX": 0.00,
        "positionY": 0.50,
        "positionZ": 0.50,
        "width": 0.50,
        "height": 1.00,
        "depth": 0.50,
        "maxDistance": 2.50,
        "minDistance": 2.50,
        "maxAzimuthAngle": -0.10,
        "minAzimuthAngle": -1.20,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# Hermes’s journey at Buenos Aires\n\nEMBA is one of Argentina’s leading institutions for higher musical education. Established in 1986, it offers a robust curriculum in music production, sound engineering, and recording techniques. The program emphasizes hands-on training in state-of-the-art recording studios, live sound mixing, and digital production software.\n\nDuring his exchange semester in 2020, Hermes immersed himself in EMBA’s dynamic environment to complement his foundational training in contemporary music from UNPHU.\n\n- **Practical Mastery:** Hermes participated in intensive workshops and masterclasses (for example, the masterclass with Pat Metheny) that focused on advanced recording techniques, digital audio processing, and live sound management. This hands-on approach enabled him to refine his technical skills and gain confidence in using cutting-edge production tools.\n- **Global Perspective:** The exchange allowed Hermes to collaborate with local Argentine musicians and producers, deepening his understanding of diverse musical styles and production methodologies. He experienced a culturally rich learning atmosphere that challenged him to innovate and adapt, broadening his creative vision.\n- **Professional Networking:** By engaging with renowned industry professionals—who often conduct guest lectures and offer one-on-one mentoring—Hermes expanded his professional network. This exposure not only enriched his artistic repertoire but also opened opportunities for future international collaborations.\n\nOverall, Hermes’s time at EMBA provided him with a pivotal international perspective, equipping him with advanced production techniques and a deeper appreciation for the global music industry. This experience has been instrumental in shaping him into a well-rounded music professional, ready to contribute creatively and technically to the industry."
    },
    {
        "key": "neumann",
        "isSubSpace": false,
        "name": "Neumann's Paradise Prototype",
        "description": "3D model",
        "parentKey": "lobby",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -1.90,
        "positionY": 0.50,
        "positionZ": 1.20,
        "width": 1.00,
        "height": 0.80,
        "depth": 0.80,
        "maxDistance": 2.20,
        "minDistance": 2.20,
        "maxAzimuthAngle": -0.80,
        "minAzimuthAngle": -2.00,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Neumann’s Paradise Project\n\nThe Neumann’s Paradise is a visionary architectural and experiential project that seeks to redefine modern entertainment and social interaction. Rooted in the pioneering spirit of John von Neumann and the intellectual frameworks of game theory, the project transforms traditional notions of leisure into a dynamic, multi-layered environment where technology and art converge. Designed for Punta Cana—a hub of tourism and cultural exchange—this proposal outlines an expansive art-tech club and thematic plaza that integrates advanced digital and immersive experiences.\n\nAt its core, the project is a celebration of the transformative power of technology, embracing a wide spectrum of high-tech entertainment offerings. From a VR arcade and immersive 270° cinema to an e-sports arena, interactive digital museums, and hologram theaters, each element is meticulously planned to cater to diverse audiences. It envisions a space where professional gamers, tech enthusiasts, families, and casual visitors can seamlessly merge physical presence with digital experiences, creating an environment that is as intellectually stimulating as it is visually captivating.\n\nBeyond its technological marvels, The Neumann’s Paradise serves as a cultural statement—a response to the evolution of social interaction in an increasingly digital world. By integrating the principles of game theory into its design, the project not only pays tribute to a legendary mathematician but also challenges conventional paradigms of spatial organization and user engagement. The proposed design harnesses concepts such as interactive urban plazas, automated systems, and sustainable technologies to create a living, adaptive venue that evolves with its community’s needs.\n\nThis proposal also addresses the broader societal shift toward digitalization and the need for physical spaces that nurture genuine human connection. It acknowledges the fragmented nature of contemporary social interactions and seeks to restore the communal spirit through immersive environments that encourage collaboration, creativity, and active participation. By positioning itself at the crossroads of art, technology, and social innovation, The Neumann’s Paradise offers a compelling blueprint for the future of experiential design—a place where digital dreams and real-world experiences converge into a singular, transformative narrative."
    },
    {
        "key": "vrheadset",
        "isSubSpace": false,
        "name": "Virtual Reality Experience",
        "description": "3D model",
        "parentKey": "lobby",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -1.90,
        "positionY": 1.10,
        "positionZ": 1.20,
        "width": 0.50,
        "height": 0.30,
        "depth": 0.50,
        "maxDistance": 2.20,
        "minDistance": 2.20,
        "maxAzimuthAngle": -0.80,
        "minAzimuthAngle": -2.00,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Virtual Reality Experience\n\nAt the Feria Internacional del Libro 2024, UNPHU distinguished itself with an innovative and interactive stand centered around its Banco Nacional de Cerebros. This exhibit showcased a cutting-edge biobank dedicated to preserving brain tissue and other human biological samples for research into neurodegenerative diseases like Alzheimer’s. Housed in the Pabellón de la Imaginación at the Plaza de la Cultura in Santo Domingo, the stand offered visitors a unique blend of science, technology, and culture.\n\nAt the UNPHU exhibition during the Feria Internacional del Libro 2024, one of the standout highlights was the immersive virtual reality experience developed by Hermes Concepción, the university's Virtual Reality professor. Hermes crafted a groundbreaking metaverse simulation that allowed visitors to virtually step into the Banco Nacional de Cerebros—a state-of-the-art biobank dedicated to neurodegenerative research.\n\n### Key Features of the Experience\n\n- **Interactive Virtual Brain:**\n    \n    The VR setup presented a highly detailed, three-dimensional model of the human brain. Users could navigate around it, zoom in on specific regions, and even \"touch\" and inspect different structures, offering an unprecedented tactile and visual understanding of neuroanatomy.\n    \n- **Educational Impact:**\n    \n    By merging advanced technology with scientific research, Hermes Concepción’s creation provided an engaging way to learn about the intricacies of the brain. This immersive experience not only showcased the potential of virtual reality in scientific outreach but also highlighted UNPHU’s commitment to integrating technology and education.\n    \n- **Metaverse Innovation:**\n    \n    The virtual environment recreated the Banco Nacional de Cerebros, allowing attendees to explore how the biobank functions and to understand its role in researching diseases like Alzheimer’s. This pioneering approach offered a glimpse into the future of interactive scientific exhibitions, where technology makes complex research accessible to a broader audience.\n\nHermes Concepción’s work represents a significant leap forward in how technology can be used to bridge the gap between science and the public. The virtual Banco Nacional de Cerebros stands as a testament to UNPHU’s innovative spirit and its dedication to advancing both research and education through immersive, interactive experiences."
    },
    {
        "key": "scrum",
        "isSubSpace": false,
        "name": "Agile/Scrum Methodology",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -0.40,
        "positionY": 1.82,
        "positionZ": -2.00,
        "width": 0.40,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "adobe",
        "isSubSpace": false,
        "name": "Adobe Suite",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -0.78,
        "positionY": 1.42,
        "positionZ": -2.00,
        "width": 0.79,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "design",
        "isSubSpace": false,
        "name": "UX/UI Design",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "scrum",
        "nearestHorizontalSibling": "adobe",
        "positionX": -0.30,
        "positionY": 1.42,
        "positionZ": -2.00,
        "width": 0.15,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "cad",
        "isSubSpace": false,
        "name": "3D Modeling (CAD)",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "design",
        "nearestHorizontalSibling": "render",
        "positionX": -0.50,
        "positionY": 1.02,
        "positionZ": -2.00,
        "width": 0.55,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "daw",
        "isSubSpace": false,
        "name": "Music Edition (DAW)",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "cad",
        "nearestHorizontalSibling": "root",
        "positionX": -0.70,
        "positionY": 0.62,
        "positionZ": -2.00,
        "width": 0.95,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "dev",
        "isSubSpace": false,
        "name": "Front-End Development",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "daw",
        "nearestHorizontalSibling": "root",
        "positionX": -0.78,
        "positionY": 0.22,
        "positionZ": -2.00,
        "width": 0.79,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "render",
        "isSubSpace": false,
        "name": "Real-Time Rendering",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "adobe",
        "nearestHorizontalSibling": "root",
        "positionX": -1.40,
        "positionY": 1.02,
        "positionZ": -2.00,
        "width": 0.40,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.30,
        "minAzimuthAngle": -0.30,
        "maxPolarAngle": 1.80,
        "minPolarAngle": 3.30,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "uxtech",
        "isSubSpace": false,
        "name": "UX/Tech-Art Portfolio",
        "description": "digital easel",
        "parentKey": "rooftop",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 2.15,
        "positionY": 3.72,
        "positionZ": -0.70,
        "width": 0.20,
        "height": 1.00,
        "depth": 1.10,
        "maxDistance": 3.00,
        "minDistance": 3.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# UX/Tech-Art Design Process\n\nHermes’s process is an iterative, structured approach to solving design challenges that begins with a thorough analysis of the problem and gradually evolves into a complete UX design wireflow and prototype. Using the ARTKET case as an example, here’s how this process might unfold:\n\nDefine and Analyze the Problem\n\nHermes’s process begins with a detailed problem analysis: identifying user pain points, market gaps, and business objectives. For ARTKET example, this involves clarifying tasks such as market analysis, generating custom quotes, and ensuring a seamless user experience. This step mirrors the initial sections of the document where the problem statement and proposal are outlined .\n\nBrainstorming Ideas\n\nNext, the process involves a creative brainstorming phase. In this stage, diverse ideas are generated to address the problem. For ARTKET, ideas might include:\n\n- How to simplify user registration and authentication (“Step 1: Authenticate”).\n- Innovative ways to display market data and analytics (“Step 2: Analyze the market”).\n- Integrating interactive features that encourage user engagement (“Step 3: Be part of the market”).This phase leverages group discussions and sketch sessions to explore multiple concepts without the constraints of technical feasibility initially.\n\nStructuring the Solution with Diagrams\n\nOnce a range of ideas is on the table, the next step is to start structuring the solution. Hermes’s process emphasizes the creation of diagrams to map out user flows and interface structures. For ARTKET, this involves:\n\n- Drafting initial flowcharts that depict user journeys—from registration and login to generating and editing price quotes.\n- Outlining key screens such as the welcome page, main dashboard, and service creation interfaces.\n- Iteratively refining these diagrams to ensure that each step logically flows into the next and that all user interactions are accounted for.The document includes several flow diagrams and wireflow sketches that exemplify this step, demonstrating how complex interactions are broken down into manageable screens and actions .\n\nDeveloping a Complete UX Design Wireflow and Prototype\n\nWith a well-structured diagram in place, the process moves toward building a high-fidelity wireflow and interactive prototype. This stage involves:\n\n- Translating the diagrams into detailed wireframes that define the layout, navigation, and key functionalities.\n- Testing these wireframes with stakeholders and potential users to gather feedback.\n- Iterating on the design until it evolves into a complete UX design that captures both the analytical and creative aspects of the platform.In the ARTKET case, the final prototype integrates business logic, user statistics, and creative flow elements into one cohesive system, demonstrating a balance between functional analysis and user-centered design.\n\nHermes’s process takes you from an in-depth understanding of the problem, through creative brainstorming and diagrammatic planning, to a fully-realized UX design and prototype. The ARTKET document serves as a practical example of this approach, showcasing everything from early-stage flowcharts to a detailed wireflow prototype that addresses the specific needs of an art market analytics platform."
    }
]