[
    {
        "key": "main",
        "isSubSpace": true,
        "name": "Hermes Science's Lab",
        "description": "metaverse space",
        "parentKey": "root",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 0.00,
        "positionY": 2.30,
        "positionZ": 0.00,
        "width": 0,
        "height": 0,
        "depth": 0,
        "maxDistance": 24.00,
        "minDistance": 18.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -1.60,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.50,
        "isLocked": false,
        "documentation": "# Hermes's Science Lab\n\n![Hermes Science Lab](/user-sources/Hermes_Science_Lab_doc-img1.svg)\n\nHermes's Science Lab is a cutting-edge, WebGL-powered digital playground meticulously crafted by **Hermes Concepción**. Designed as a welcoming portal for virtual guests, this interactive website not only invites you to explore its dynamic 3D environments but also serves as a living portfolio showcasing Hermes's professional expertise in several innovative fields.\n\n## Project Demostrations\n\n- **Virtual and Augmented Reality (VR/AR):**  \n  Dive into immersive experiences that blend the digital and physical worlds, demonstrating state-of-the-art techniques in spatial computing.\n\n- **3D Interactive Experiences:**  \n  Engage with stunning, real-time rendered scenes that push the boundaries of interactivity and visual storytelling.\n\n- **Creative Web Development:**  \n  Experience the seamless fusion of art and technology, where cutting-edge code meets imaginative design to create captivating online journeys.\n\n- **User Experience (UX) and Interface Design (UI):**  \n  Discover thoughtfully crafted interactions and interfaces that prioritize intuitive navigation and a delightful user journey.\n\nHermes's Science Lab is more than just a website; it’s an experimental space where advanced technology and creative design converge. Whether you're a tech enthusiast, a design aficionado, or a prospective client looking for innovative digital solutions, this lab provides a firsthand look at the future of interactive web experiences. Step inside and witness the next evolution of digital creativity, where every click reveals a new dimension of professional artistry and technological prowess."

    },
    {
        "key": "studio",
        "isSubSpace": true,
        "name": "Prané Music Studio",
        "description": "musical workspace",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "awards",
        "positionX": 2.25,
        "positionY": 1.50,
        "positionZ": 1.60,
        "width": 1.50,
        "height": 2.20,
        "depth": 2.00,
        "maxDistance": 6.00,
        "minDistance": 5.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Prané Music Studio\n\n![Prané Music Studio](/user-sources/Prane_Music_Studio_doc_img1.svg)\n\nPrané Music Studio is a dedicated audio laboratory within Hermes’s Science Lab, reflecting Hermes Concepción’s deep passion for music composition, sound design, and audio production. From conceptualizing original scores for video games and films to refining final mixes, this immersive environment showcases the artistry and technical skill behind professional music creation.\n\n## Our Focus\n\n- **Composition & Arrangement** \n Explore the process of crafting memorable melodies, harmonies, and orchestral arrangements designed to captivate audiences across various media.\n \n- **Audio Editing & Mixing** \n Discover how raw recordings are refined into polished tracks, balancing clarity and depth to create immersive listening experiences.\n\n- **Film Scoring** \n At Prané Music Studio, film scoring is more than just background music; it’s about crafting an emotional narrative that supports and elevates the visual storytelling. Our process includes thematic development, orchestration and arrangement and adaptive scoring for film synchronization.\n\n- **Interactive Music for Games** \n Gaming is an immersive experience where music plays a crucial role in shaping the player’s journey. Our approach to interactive music for games is centered on creating dynamic soundscapes that respond to gameplay in real time.\n\n## Why Prané?\n\nPrané Music Studio exemplifies Hermes’s innovative approach to blending technology and creativity. Within this virtual space, visitors can feel the workspace where all the magic happens, in collaboration with Caribbean Dream Studios.\n\nHere, every note and sound effect resonates with the spirit of experimentation, pushing the boundaries of audio innovation in the same pioneering way Hermes’s Science Lab expands the horizons of immersive digital experiences."
    },
    {
        "key": "awards",
        "isSubSpace": true,
        "name": "Achievement Zone",
        "description": "trophy's table",
        "parentKey": "main",
        "nearestVerticalSibling": "certificates",
        "nearestHorizontalSibling": "lobby",
        "positionX": 0.25,
        "positionY": 0.70,
        "positionZ": 2.25,
        "width": 0.50,
        "height": 0.60,
        "depth": 1.50,
        "maxDistance": 3.00,
        "minDistance": 3.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# Achievement Zone\n\n![Achievement Zone](/user-sources/Achievements_Table_doc_img1.svg)\n\nThe Achievement Zone is a celebratory gallery within Hermes’s Science Lab, dedicated to highlighting Hermes Concepción’s most notable triumphs in national innovation, culture, and entrepreneurship competitions. Visitors can explore a virtual showcase of trophies that represent each accomplishment, reflecting both the hard work and the visionary spirit behind Hermes’s journey.\n\n## What can you find here?\n\n- **National Recognition** \n Discover how Hermes’s projects and ideas have garnered attention at the national level, showcasing excellence in creative thinking and implementation.\n\n- **Innovation & Entrepreneurship** \n Gain insight into award-winning endeavors that push the boundaries of technology and business, reinforcing a commitment to progress and development.\n\n- **Cultural Impact** \n Explore achievements that celebrate cultural enrichment and diversity, emphasizing the power of creativity and community engagement.\n\nThe Achievement Zone offers a glimpse into the milestones that have shaped Hermes’s professional path, underscoring the dedication, innovation, and passion needed to excel in competitive fields."
    },
    {
        "key": "lobby",
        "isSubSpace": true,
        "name": "Environment Design Zone",
        "description": "lobby space",
        "parentKey": "main",
        "nearestVerticalSibling": "library",
        "nearestHorizontalSibling": "root",
        "positionX": -1.90,
        "positionY": 0.50,
        "positionZ": 1.20,
        "width": 1.20,
        "height": 1.00,
        "depth": 1.00,
        "maxDistance": 5.00,
        "minDistance": 5.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Environment Design Zone\n\n![Environment Design Zone](/user-sources/Environment_Design_doc_img1.svg)\n\nThe Environment Design Zone functions as a lobby within Hermes’s Science Lab, showcasing an architectural-scale model (prototype) that spotlights Hermes Concepción’s expertise in crafting immersive digital landscapes. From conceptualizing virtual worlds to integrating them seamlessly into video games and other interactive experiences, this space highlights Hermes’s passion for environmental storytelling and architectural design.\n\n## Our Focus\n\n- **Conceptual Vision & Worldbuilding** \n Explore the creative process behind designing environments that blend narrative, aesthetics, and technical considerations to shape compelling digital worlds.\n\n- **3D Modeling & Architectural Prototyping** \n Discover scaled models and prototypes that demonstrate how real-world architectural principles can be adapted to create believable, functional spaces in virtual media.\n\n- **Technical Implementation & Optimization** \n Delve into performance considerations, from polygon count management to efficient rendering techniques, ensuring smooth and responsive user interactions.\n\nThe Environment Design Zone offers insight into the architectural and creative processes that bring virtual worlds to life. Step in to experience a realm where imagination meets practical ingenuity, reinforcing the spirit of exploration that underpins every corner of Hermes’s Science Lab."
    },
    {
        "key": "library",
        "isSubSpace": true,
        "name": "Software Library",
        "description": "bookshelf",
        "parentKey": "main",
        "nearestVerticalSibling": "stairs",
        "nearestHorizontalSibling": "root",
        "positionX": -1.00,
        "positionY": 0.90,
        "positionZ": -2.00,
        "width": 2.00,
        "height": 1.80,
        "depth": 0.50,
        "maxDistance": 5.00,
        "minDistance": 5.00,
        "maxAzimuthAngle": 0.10,
        "minAzimuthAngle": -0.40,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Software Library\n\n![Software Library](/user-sources/Software_Library_doc_img1.svg)\n\nThe Software Library is a virtual bookshelf where every book tells a story of digital craftsmanship. Here, technical know-how is reimagined as the essential building blocks of creative expression, laying the foundation for interactive experiences, evocative music compositions, artistic CGI, and a vast array of digital arts.\n\n### A Treasury of Tools & Techniques\n\nWithin this curated collection, each volume delves into the software and methodologies that drive innovation. These texts are not mere instruction manuals, they are blueprints for transformation. Whether uncovering advanced coding paradigms, exploring state-of-the-art design frameworks, or detailing dynamic production pipelines, every book reveals the inner workings of Hermes’s creative process.\n\n### Bridging the Gap Between Code and Creativity\n\nAt its core, the Software Library is a celebration of the symbiotic relationship between art and technology. It underscores the idea that technical expertise is itself an art form; a canvas where logic meets imagination. As you peruse these digital tomes, you gain insight into how meticulous planning, innovative tools, and refined processes come together to produce compelling digital narratives."
    },
    {
        "key": "wall",
        "isSubSpace": true,
        "name": "Proyect's Wall",
        "description": "wall",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "library",
        "positionX": -0.20,
        "positionY": 1.50,
        "positionZ": -0.80,
        "width": 0.15,
        "height": 2.20,
        "depth": 2.00,
        "maxDistance": 5.00,
        "minDistance": 5.00,
        "maxAzimuthAngle": -1.00,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# Proyect's Wall\n\nIn a quiet alcove of Hermes’s Science Lab, a wall stands adorned with frames; each one a portal into worlds conceived purely for the sake of creation. This is not a gallery of accolades; it’s a sanctuary where projects exist as whispers of possibility, built by and for the dreamers who dare to prototype the world they imagine.\n\nOn the left, two frames invite a closer look. One captures the silhouette of a lifeguard tower, its innovative scissors-like design challenging conventional forms, evoking both functionality and poetry in motion. Beside it, another frame reveals a mobile app that measures the intangible worth of artistic industries—a digital exploration into the value of creativity, untethered by the pursuit of profit.\n\nThese visions were born not from a need to monetize, but from the pure, unfiltered desire to explore and experiment. Here, design transcends the ordinary, and every project is an intimate conversation between the creator and the possibility of what might be. The Prototype Wall is a gentle reminder that sometimes, the most profound innovations arise when we build not for the market, but for our own souls."
    },
    {
        "key": "corner",
        "isSubSpace": true,
        "name": "Background Zone",
        "description": "wall corner",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "wall",
        "positionX": 0.25,
        "positionY": 1.00,
        "positionZ": 0.50,
        "width": 0.80,
        "height": 2.00,
        "depth": 0.50,
        "maxDistance": 5.00,
        "minDistance": 5.00,
        "maxAzimuthAngle": 0.40,
        "minAzimuthAngle": -0.70,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": "# Background Zone\n\n![Background Zone](/user-sources/Background_Corner_doc_img1.svg)\n\nIn this quiet nook, a wall proudly displays the certificates that mark key milestones in a lifelong pursuit of knowledge and creativity. Here, formal achievements in Architecture and Music stand side by side, each symbolizing a deep commitment to understanding space and sound.\n\nA Master’s degree in Videogames crowns the collection; a unique fusion of the two disciplines that not only bridges traditional artistry and design but also transforms them into immersive, interactive digital experiences. This corner isn’t merely a record of academic accomplishments; it’s a window into the journey that empowers every innovative project conceived by Hermes."
    },
    {
        "key": "stairs",
        "isSubSpace": false,
        "name": "Handmade Portfolio",
        "description": "framed panel",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -2.50,
        "positionY": 2.30,
        "positionZ": -2.70,
        "width": 0.90,
        "height": 1.20,
        "depth": 0.30,
        "maxDistance": 3.00,
        "minDistance": 3.00,
        "maxAzimuthAngle": 0.10,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# Conceptual Drawing: 'It's not that hard to catch humans'\n\nIn this evocative handmade surreal drawing, Hermes distills a profound social commentary into a single, arresting image. At first glance, a serene floating island cradles a treasure concealed beneath a solitary tree—a beacon of allure and promise. Yet, as one’s gaze travels beyond this inviting tableau, the island is revealed to be circumscribed by a vast, imposing cage. Circling this prison are sharks, their presence both graceful and menacing, as they patrol the periphery with an ever-watchful vigilance.\n\nThe long, winding path that leads to the treasure serves as a metaphor for human ambition and the pursuit of wealth. However, the very guardians of this coveted bounty (the sharks) hint at a darker truth. The treasure, rather than being a reward, is cast in the role of bait, meticulously placed to ensnare the unsuspecting traveler. In this paradox, Hermes exposes the vulnerability of human desire: even when the trap is laid bare, the seductive pull of riches remains irresistibly potent.\n\nBy interweaving elements of nature and contrived design, the drawing challenges the viewer to confront the paradox of temptation. It is a visual allegory that critiques how the promise of material gain can often mask a deliberate ploy; a reminder that what glitters may well be a well-orchestrated snare, poised to capture those who dare to dream too freely."
    },
    {
        "key": "rooftop",
        "isSubSpace": true,
        "name": "UX/Tech-Art Studio",
        "description": "conceptual rooftop",
        "parentKey": "main",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "stairs",
        "positionX": 1.50,
        "positionY": 3.50,
        "positionZ": -1.00,
        "width": 2.00,
        "height": 2.00,
        "depth": 2.00,
        "maxDistance": 6.00,
        "minDistance": 6.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": "# UX/Tech-Art Studio\n\n![UX/Tech-Art Studio](/user-sources/UX_Tech-Art_doc_img1.svg)\n\nPerched on the rooftop of Hermes’s Science Lab, the UX/Tech-Art Studio is an enclave where disciplined creativity takes flight. Dominating the space is an immense, otherworldly tree; a symbolic beacon that defies conventional architectural logic. Its sprawling, surreal branches represent the uncharted pathways of thought, providing a visual metaphor for deep concentration and the organic growth of innovative ideas.\n\nBeneath this striking arboreal figure lies a digital easel paired with a solitary chair: a minimalist yet potent setup for contemplation. Here, the tools of the trade are both literal and metaphorical. The easel stands as a platform for conceptual sketches, algorithms, and design frameworks, while the chair invites one to pause, reflect, and dissect the intricate problems of computer graphics and interactive experiences. This is where mathematical precision converges with artistic expression, forming a sanctuary for UX refinement and tech-art exploration.\n\nIn this elevated retreat, the seemingly paradoxical elements (a fantastical tree, a digital canvas, and the quiet intensity of focused thought) come together to illustrate a personal paradise for innovation. It is a realm where the complexities of digital interactivity are unraveled and reimagined, one deliberate stroke of insight at a time."
    },
    {
        "key": "musicportfolio",
        "isSubSpace": false,
        "name": "Music Portfolio",
        "description": "TV screen",
        "parentKey": "studio",
        "nearestVerticalSibling": "aboutprane",
        "nearestHorizontalSibling": "root",
        "positionX": 2.60,
        "positionY": 1.50,
        "positionZ": 1.60,
        "width": 0.10,
        "height": 0.70,
        "depth": 1.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": -1.57,
        "minAzimuthAngle": -1.57,
        "maxPolarAngle": 1.90,
        "minPolarAngle": 1.90,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "aboutprane",
        "isSubSpace": false,
        "name": "Prané Music Branding",
        "description": "logotype panel",
        "parentKey": "studio",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 2.70,
        "positionY": 2.30,
        "positionZ": 1.60,
        "width": 0.30,
        "height": 0.80,
        "depth": 1.80,
        "maxDistance": 3.00,
        "minDistance": 3.00,
        "maxAzimuthAngle": -0.80,
        "minAzimuthAngle": -1.85,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "nodes",
        "isSubSpace": false,
        "name": "Procedural Design",
        "description": "left sided monitor screen",
        "parentKey": "studio",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 2.38,
        "positionY": 1.03,
        "positionZ": 1.33,
        "width": 0.08,
        "height": 0.30,
        "depth": 0.50,
        "maxDistance": 1.00,
        "minDistance": 1.00,
        "maxAzimuthAngle": -1.85,
        "minAzimuthAngle": -1.85,
        "maxPolarAngle": 1.90,
        "minPolarAngle": 1.90,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "filmscore",
        "isSubSpace": false,
        "name": "Music for Films",
        "description": "right sided monitor screen",
        "parentKey": "studio",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "webgl",
        "positionX": 2.38,
        "positionY": 1.03,
        "positionZ": 1.87,
        "width": 0.08,
        "height": 0.30,
        "depth": 0.50,
        "maxDistance": 1.00,
        "minDistance": 1.00,
        "maxAzimuthAngle": -1.15,
        "minAzimuthAngle": -1.15,
        "maxPolarAngle": 1.90,
        "minPolarAngle": 1.90,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "webgl",
        "isSubSpace": false,
        "name": "WebGL Coding",
        "description": "laptop screen",
        "parentKey": "studio",
        "nearestVerticalSibling": "musicportfolio",
        "nearestHorizontalSibling": "nodes",
        "positionX": 2.07,
        "positionY": 0.86,
        "positionZ": 1.59,
        "width": 0.08,
        "height": 0.30,
        "depth": 0.36,
        "maxDistance": 1.00,
        "minDistance": 1.00,
        "maxAzimuthAngle": -0.70,
        "minAzimuthAngle": -1.85,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "mipymes",
        "isSubSpace": false,
        "name": "Bussiness Creation Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 1.68,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "musiccontest",
        "isSubSpace": false,
        "name": "Music Composition Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "mipymes",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 1.94,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "bcrd",
        "isSubSpace": false,
        "name": "Payment Methods Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "musiccontest",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 2.21,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "arqtur",
        "isSubSpace": false,
        "name": "Architectural Design Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "bcrd",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 2.48,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "literary",
        "isSubSpace": false,
        "name": "Storytelling Script Award",
        "description": "trophy",
        "parentKey": "awards",
        "nearestVerticalSibling": "arqtur",
        "nearestHorizontalSibling": "root",
        "positionX": 0.22,
        "positionY": 0.76,
        "positionZ": 2.74,
        "width": 0.15,
        "height": 0.30,
        "depth": 0.15,
        "maxDistance": 1.50,
        "minDistance": 1.50,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "lifeguard",
        "isSubSpace": false,
        "name": "Lifeguard Booth Design Award",
        "description": "board",
        "parentKey": "wall",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -0.20,
        "positionY": 1.98,
        "positionZ": -1.35,
        "width": 0.10,
        "height": 0.90,
        "depth": 0.65,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.70,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "prototype",
        "isSubSpace": false,
        "name": "UX/UI Prototype",
        "description": "board",
        "parentKey": "wall",
        "nearestVerticalSibling": "lifeguard",
        "nearestHorizontalSibling": "root",
        "positionX": -0.20,
        "positionY": 0.91,
        "positionZ": -1.35,
        "width": 0.10,
        "height": 0.90,
        "depth": 0.65,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.10,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "architecturedegree",
        "isSubSpace": false,
        "name": "Bachelors Degree of Architecture",
        "description": "certificate",
        "parentKey": "corner",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 0.32,
        "positionY": 1.63,
        "positionZ": 0.30,
        "width": 0.42,
        "height": 0.50,
        "depth": 0.10,
        "maxDistance": 1.20,
        "minDistance": 1.20,
        "maxAzimuthAngle": 0.40,
        "minAzimuthAngle": -0.40,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "musicdegree",
        "isSubSpace": false,
        "name": "Bachelors Degree of Contemporary Music",
        "description": "certificate",
        "parentKey": "corner",
        "nearestVerticalSibling": "architecturedegree",
        "nearestHorizontalSibling": "guitar",
        "positionX": 0.32,
        "positionY": 1.19,
        "positionZ": 0.30,
        "width": 0.42,
        "height": 0.32,
        "depth": 0.10,
        "maxDistance": 1.00,
        "minDistance": 1.00,
        "maxAzimuthAngle": 0.40,
        "minAzimuthAngle": -0.40,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "guitar",
        "isSubSpace": false,
        "name": "Musical Performance",
        "description": "guitar",
        "parentKey": "corner",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 0.00,
        "positionY": 0.50,
        "positionZ": 0.50,
        "width": 0.50,
        "height": 1.00,
        "depth": 0.50,
        "maxDistance": 2.50,
        "minDistance": 2.50,
        "maxAzimuthAngle": -0.10,
        "minAzimuthAngle": -1.20,
        "maxPolarAngle": 2.30,
        "minPolarAngle": 5.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "neumann",
        "isSubSpace": false,
        "name": "Neumann's Paradise Prototype",
        "description": "3D model",
        "parentKey": "lobby",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -1.90,
        "positionY": 0.55,
        "positionZ": 1.20,
        "width": 1.00,
        "height": 1.00,
        "depth": 0.80,
        "maxDistance": 2.20,
        "minDistance": 2.20,
        "maxAzimuthAngle": -0.80,
        "minAzimuthAngle": -2.00,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "scrum",
        "isSubSpace": false,
        "name": "Agile/Scrum Methodology",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -0.40,
        "positionY": 1.82,
        "positionZ": -2.00,
        "width": 0.40,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "adobe",
        "isSubSpace": false,
        "name": "Adobe Suite",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": -0.78,
        "positionY": 1.42,
        "positionZ": -2.00,
        "width": 0.79,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "design",
        "isSubSpace": false,
        "name": "UX/UI Design",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "scrum",
        "nearestHorizontalSibling": "adobe",
        "positionX": -0.30,
        "positionY": 1.42,
        "positionZ": -2.00,
        "width": 0.15,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "cad",
        "isSubSpace": false,
        "name": "3D Modeling (CAD)",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "design",
        "nearestHorizontalSibling": "render",
        "positionX": -0.50,
        "positionY": 1.02,
        "positionZ": -2.00,
        "width": 0.55,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "daw",
        "isSubSpace": false,
        "name": "Music Edition (DAW)",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "cad",
        "nearestHorizontalSibling": "root",
        "positionX": -0.70,
        "positionY": 0.62,
        "positionZ": -2.00,
        "width": 0.95,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "dev",
        "isSubSpace": false,
        "name": "Front-End Development",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "daw",
        "nearestHorizontalSibling": "root",
        "positionX": -0.78,
        "positionY": 0.22,
        "positionZ": -2.00,
        "width": 0.79,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.00,
        "minAzimuthAngle": -0.60,
        "maxPolarAngle": 2.10,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "render",
        "isSubSpace": false,
        "name": "Real-Time Rendering",
        "description": "book collection",
        "parentKey": "library",
        "nearestVerticalSibling": "adobe",
        "nearestHorizontalSibling": "root",
        "positionX": -1.40,
        "positionY": 1.02,
        "positionZ": -2.00,
        "width": 0.40,
        "height": 0.35,
        "depth": 0.30,
        "maxDistance": 2.00,
        "minDistance": 2.00,
        "maxAzimuthAngle": 0.30,
        "minAzimuthAngle": -0.30,
        "maxPolarAngle": 1.80,
        "minPolarAngle": 3.30,
        "isLocked": false,
        "documentation": null
    },
    {
        "key": "uxtech",
        "isSubSpace": false,
        "name": "UX/Tech-Art Portfolio",
        "description": "digital easel",
        "parentKey": "rooftop",
        "nearestVerticalSibling": "root",
        "nearestHorizontalSibling": "root",
        "positionX": 2.15,
        "positionY": 3.72,
        "positionZ": -0.70,
        "width": 0.20,
        "height": 1.00,
        "depth": 1.10,
        "maxDistance": 3.00,
        "minDistance": 3.00,
        "maxAzimuthAngle": -0.40,
        "minAzimuthAngle": -1.45,
        "maxPolarAngle": 2.00,
        "minPolarAngle": 3.00,
        "isLocked": false,
        "documentation": null
    }
]